# PolylineNode Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
PolylineNode Class
Members See Also
---
An output node that represents a 3D polyline.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class PolylineNode : ModelCurveNode
```

Visual Basic
---
```text
Public Class PolylineNode _
	Inherits ModelCurveNode
```

Visual C++
---
```text
public ref class PolylineNode : public ModelCurveNode
```

# Remarks
See also: [!:Autodesk::Revit::DB::IModelExportContext::OnPolyline].
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..ModelCurveNode Autodesk.Revit.DB..::..PolylineNode
# See Also
PolylineNode Members
Autodesk.Revit.DB Namespace